import React from 'react'
import './PrivacyPolicy.scss'

const PrivacyPolicy = () => {
	return (
		<div className="privacy-policy">
			<h1>Политика конфиденциальности</h1>
			<p>
				<strong>Дата вступления в силу: [Дата]</strong>
			</p>

			<p>
				Мы, компания КимЛиПак, стремимся к защите вашей конфиденциальности. Эта
				Политика конфиденциальности объясняет, как мы собираем, используем,
				раскрываем и защищаем информацию, которую мы получаем о вас через наш
				веб-сайт [ваш домен] (далее «Сайт»).
			</p>

			<h2>1. Сбор информации</h2>
			<p>
				Мы собираем информацию, которую вы предоставляете нам непосредственно,
				например, когда вы заполняете формы, подписываетесь на рассылки или
				связываетесь с нами. Эта информация может включать ваше имя, адрес
				электронной почты, номер телефона и другую контактную информацию.
			</p>
			<p>
				Мы также собираем информацию автоматически, когда вы посещаете наш Сайт,
				такую как IP-адрес, данные о браузере, информацию о посещенных страницах
				и другую информацию, связанную с вашим использованием Сайта.
			</p>

			<h2>2. Использование информации</h2>
			<p>Мы используем собранную информацию для следующих целей:</p>
			<ul>
				<li>Обработка ваших запросов и предоставление услуг.</li>
				<li>Улучшение нашего Сайта и услуг.</li>
				<li>
					Отправка вам информации о наших продуктах и услугах, если вы согласны
					на получение таких уведомлений.
				</li>
				<li>
					Анализ использования Сайта для улучшения его функциональности и
					удобства.
				</li>
			</ul>

			<h2>3. Раскрытие информации</h2>
			<p>
				Мы не передаем вашу личную информацию третьим лицам, за исключением
				случаев, когда это необходимо для выполнения наших обязательств перед
				вами или по требованию закона. Мы можем использовать сторонние сервисы
				для обработки данных, но такие компании обязаны соблюдать строгие
				условия конфиденциальности.
			</p>

			<h2>4. Защита информации</h2>
			<p>
				Мы принимаем разумные меры для защиты вашей личной информации от
				несанкционированного доступа, использования или раскрытия. Однако ни
				один метод передачи данных через Интернет и ни один метод электронного
				хранения не является полностью безопасным, и мы не можем гарантировать
				абсолютную безопасность.
			</p>

			<h2>5. Ваши права</h2>
			<p>
				Вы имеете право на доступ к вашим личным данным, их исправление и
				удаление. Если вы хотите воспользоваться этими правами, пожалуйста,
				свяжитесь с нами через контактную информацию, указанную ниже.
			</p>

			<h2>6. Изменения в политике конфиденциальности</h2>
			<p>
				Мы можем периодически обновлять эту Политику конфиденциальности. Все
				изменения будут опубликованы на этой странице с указанием даты
				вступления в силу.
			</p>

			<h2>7. Контактная информация</h2>
			<p>
				Если у вас есть вопросы или замечания относительно нашей Политики
				конфиденциальности, пожалуйста, свяжитесь с нами по адресу:
			</p>
			<p>Электронная почта: idknw@blyat.ru </p>
			<p>Адрес: ул. Пушкина, 0, Город: Далёкий, Страна: Великая </p>
		</div>
	)
}

export default PrivacyPolicy
