import React from 'react';
import './TermsOfService.scss'; 

const TermsOfService = () => {
    return (
        <div className="terms-of-service">
            <h1>Условия использования</h1>
            <p><strong>Дата вступления в силу: 06.09.2024</strong></p>

            <p>Пожалуйста, внимательно прочитайте эти Условия использования перед тем, как использовать наш веб-сайт www.KimLiPack.ru (далее «Сайт»). Использование нашего Сайта означает ваше согласие с этими Условиями использования. Если вы не согласны с этими условиями, пожалуйста, не используйте наш Сайт.</p>

            <h2>1. Использование Сайта</h2>
            <p>Вы соглашаетесь использовать наш Сайт только в законных целях и в соответствии с применимыми законами и правилами. Вы не должны использовать наш Сайт:</p>
            <ul>
                <li>Для нарушения прав интеллектуальной собственности.</li>
                <li>Для распространения вредоносных программ или вирусов.</li>
                <li>Для сбора или хранения личной информации других пользователей без их согласия.</li>
            </ul>

            <h2>2. Ограничение ответственности</h2>
            <p>Наш Сайт предоставляется на условиях «как есть» и «как доступно». Мы не несем ответственности за любые убытки или повреждения, которые могут возникнуть в результате использования или невозможности использования Сайта. Мы не гарантируем, что Сайт будет работать без перебоев, ошибок или вирусов.</p>

            <h2>3. Интеллектуальная собственность</h2>
            <p>Все права на контент, размещенный на нашем Сайте, включая текст, изображения, графику и логотипы, являются нашей собственностью или предоставлены нам с разрешения владельцев прав. Вы не можете копировать, воспроизводить или использовать эти материалы без нашего предварительного письменного согласия.</p>

            <h2>4. Ссылки на сторонние сайты</h2>
            <p>Наш Сайт может содержать ссылки на сторонние сайты, которые не контролируются нами. Мы не несем ответственности за содержание или политику конфиденциальности этих сторонних сайтов.</p>

            <h2>5. Изменения в Условиях использования</h2>
            <p>Мы оставляем за собой право изменять эти Условия использования в любое время. Все изменения вступают в силу сразу после публикации на этой странице. Продолжение использования Сайта после внесения изменений означает ваше согласие с новыми условиями.</p>

            <h2>6. Прекращение использования</h2>
            <p>Мы оставляем за собой право прекратить доступ к нашему Сайту любому пользователю, который нарушает эти Условия использования, без предварительного уведомления.</p>

            <h2>7. Контактная информация</h2>
            <p>Если у вас есть вопросы по поводу этих Условий использования, пожалуйста, свяжитесь с нами по адресу:</p>
            <p>Электронная почта: idknw@blyat.ru </p>
            <p>Адрес: ул. Пушкина, 0, Город: Далёкий, Страна: Великая</p>
        </div>
    );
};

export default TermsOfService;
